PodspecDependencyReport/PodspecDependencies_internal.dot
digraph PodspecDependencies {
  rankdir=LR;
  node [shape=box, fontname="Helvetica"];
  "BRPickerViewSwift";
  "Flutter";
  "FlutterPluginRegistrant";
  "JobsAppDoor";
  "JobsAppIconRibbon";
  "JobsAudioRecorder";
  "JobsBluetooth";
  "JobsBy3rdTools";
  "JobsByPDFKit";
  "JobsByPhotosUI";
  "JobsByQuartzCore";
  "JobsByUIKit";
  "JobsByWebKit";
  "JobsCountdownButton";
  "JobsCryptoKit";
  "JobsEmptyView";
  "JobsFuseAnimation";
  "JobsGestureUnlock";
  "JobsGetWindow";
  "JobsIconfont";
  "JobsImageRotation";
  "JobsImageTools";
  "JobsInheritance";
  "JobsLocalNotification";
  "JobsLuckyEnvelopeRain";
  "JobsMarqueeView";
  "JobsNavBar";
  "JobsNetworking";
  "JobsOCDSL";
  "JobsProgressBar";
  "JobsScale";
  "JobsScreenCapture";
  "JobsSwiftAppTools";
  "JobsSwiftBaseDefines";
  "JobsSwiftBaseTools";
  "JobsSwiftBlock";
  "JobsSwiftCalendar";
  "JobsSwiftComment";
  "JobsSwiftCountryCodeCtrl";
  "JobsSwiftDSL";
  "JobsSwiftDebugTools";
  "JobsSwiftExcel";
  "JobsSwiftFoundation";
  "JobsSwiftGraphicCaptcha";
  "JobsSwiftLinkageMenuView";
  "JobsSwiftMarkdown";
  "JobsSwiftMetalKit";
  "JobsSwiftNumberStepper";
  "JobsSwiftOpen";
  "JobsSwiftPatch";
  "JobsSwiftRefresher";
  "JobsSwiftSearcher";
  "JobsSwiftSplash";
  "JobsSwiftStandardLibrary";
  "JobsSwiftTaskCenter";
  "JobsSwiftTimer";
  "JobsSwiftTimerMgr";
  "JobsSwiftTools";
  "JobsSwiftUILabelScrolling";
  "JobsSwiftWebSocket";
  "JobsSwiftWorker";
  "JobsTextTools";
  "JobsToast";
  "JobsViewPush";
  "JobsWalletCard";
  "Jobsl10n";
  "Texture";
  "TextureSwiftSupport";
  "BRPickerViewSwift" -> "JobsByUIKit";
  "BRPickerViewSwift" -> "JobsSwiftDSL";
  "FlutterPluginRegistrant" -> "Flutter";
  "JobsAppDoor" -> "JobsByUIKit";
  "JobsAppDoor" -> "JobsCountdownButton";
  "JobsAppDoor" -> "JobsInheritance";
  "JobsAppDoor" -> "JobsSwiftBaseDefines";
  "JobsAppDoor" -> "JobsSwiftCountryCodeCtrl";
  "JobsAppDoor" -> "JobsSwiftDSL";
  "JobsAppDoor" -> "JobsSwiftGraphicCaptcha";
  "JobsAudioRecorder" -> "JobsFuseAnimation";
  "JobsAudioRecorder" -> "JobsSwiftBaseDefines";
  "JobsAudioRecorder" -> "JobsSwiftDSL";
  "JobsAudioRecorder" -> "JobsSwiftTimer";
  "JobsBy3rdTools" -> "JobsByUIKit";
  "JobsBy3rdTools" -> "JobsInheritance";
  "JobsBy3rdTools" -> "JobsScale";
  "JobsBy3rdTools" -> "JobsSwiftBaseDefines";
  "JobsBy3rdTools" -> "JobsSwiftBaseTools";
  "JobsBy3rdTools" -> "JobsSwiftDSL";
  "JobsBy3rdTools" -> "JobsSwiftMetalKit";
  "JobsBy3rdTools" -> "JobsSwiftStandardLibrary";
  "JobsBy3rdTools" -> "JobsSwiftTools";
  "JobsBy3rdTools" -> "JobsTextTools";
  "JobsByPDFKit" -> "JobsSwiftDSL";
  "JobsByPhotosUI" -> "JobsSwiftDSL";
  "JobsByQuartzCore" -> "JobsSwiftBaseDefines";
  "JobsByQuartzCore" -> "JobsSwiftBlock";
  "JobsByQuartzCore" -> "JobsSwiftDSL";
  "JobsByUIKit" -> "JobsByQuartzCore";
  "JobsByUIKit" -> "JobsImageTools";
  "JobsByUIKit" -> "JobsNavBar";
  "JobsByUIKit" -> "JobsScale";
  "JobsByUIKit" -> "JobsSwiftBaseDefines";
  "JobsByUIKit" -> "JobsSwiftBlock";
  "JobsByUIKit" -> "JobsSwiftDSL";
  "JobsByUIKit" -> "JobsSwiftTimer";
  "JobsByUIKit" -> "JobsTextTools";
  "JobsByUIKit" -> "JobsViewPush";
  "JobsByUIKit" -> "Jobsl10n";
  "JobsByWebKit" -> "JobsByUIKit";
  "JobsByWebKit" -> "JobsSwiftDSL";
  "JobsCountdownButton" -> "JobsByUIKit";
  "JobsCountdownButton" -> "JobsSwiftBaseDefines";
  "JobsCountdownButton" -> "JobsSwiftDSL";
  "JobsCountdownButton" -> "JobsSwiftTimer";
  "JobsEmptyView" -> "JobsByUIKit";
  "JobsEmptyView" -> "JobsSwiftBaseDefines";
  "JobsEmptyView" -> "JobsSwiftBlock";
  "JobsEmptyView" -> "JobsSwiftDSL";
  "JobsFuseAnimation" -> "JobsByUIKit";
  "JobsFuseAnimation" -> "JobsSwiftBaseDefines";
  "JobsFuseAnimation" -> "JobsSwiftDSL";
  "JobsFuseAnimation" -> "JobsSwiftTimer";
  "JobsGestureUnlock" -> "JobsByUIKit";
  "JobsGestureUnlock" -> "JobsSwiftBaseDefines";
  "JobsGestureUnlock" -> "JobsSwiftBlock";
  "JobsGestureUnlock" -> "JobsSwiftDSL";
  "JobsIconfont" -> "JobsImageTools";
  "JobsIconfont" -> "JobsSwiftDSL";
  "JobsImageRotation" -> "JobsSwiftDSL";
  "JobsImageRotation" -> "JobsSwiftTimer";
  "JobsImageTools" -> "JobsSwiftBaseDefines";
  "JobsImageTools" -> "JobsSwiftBlock";
  "JobsImageTools" -> "JobsSwiftDSL";
  "JobsInheritance" -> "JobsByUIKit";
  "JobsInheritance" -> "JobsByWebKit";
  "JobsInheritance" -> "JobsNavBar";
  "JobsInheritance" -> "JobsSwiftBaseDefines";
  "JobsInheritance" -> "JobsSwiftBlock";
  "JobsInheritance" -> "JobsSwiftDSL";
  "JobsInheritance" -> "JobsSwiftDebugTools";
  "JobsInheritance" -> "JobsSwiftFoundation";
  "JobsInheritance" -> "JobsSwiftStandardLibrary";
  "JobsInheritance" -> "JobsToast";
  "JobsLocalNotification" -> "JobsByUIKit";
  "JobsLocalNotification" -> "JobsSwiftTools";
  "JobsLuckyEnvelopeRain" -> "JobsByUIKit";
  "JobsLuckyEnvelopeRain" -> "JobsSwiftBaseDefines";
  "JobsLuckyEnvelopeRain" -> "JobsSwiftDSL";
  "JobsLuckyEnvelopeRain" -> "JobsSwiftTimer";
  "JobsMarqueeView" -> "JobsByUIKit";
  "JobsMarqueeView" -> "JobsSwiftBaseDefines";
  "JobsMarqueeView" -> "JobsSwiftDSL";
  "JobsMarqueeView" -> "JobsSwiftTimer";
  "JobsNavBar" -> "JobsSwiftBaseDefines";
  "JobsNavBar" -> "JobsSwiftBlock";
  "JobsNavBar" -> "JobsSwiftDSL";
  "JobsNetworking" -> "JobsSwiftDSL";
  "JobsOCDSL" -> "Texture";
  "JobsProgressBar" -> "JobsByUIKit";
  "JobsProgressBar" -> "JobsSwiftBaseDefines";
  "JobsProgressBar" -> "JobsSwiftDSL";
  "JobsProgressBar" -> "JobsSwiftTimer";
  "JobsScale" -> "JobsGetWindow";
  "JobsScreenCapture" -> "JobsSwiftDSL";
  "JobsSwiftAppTools" -> "JobsBy3rdTools";
  "JobsSwiftAppTools" -> "JobsByUIKit";
  "JobsSwiftAppTools" -> "JobsInheritance";
  "JobsSwiftAppTools" -> "JobsScale";
  "JobsSwiftAppTools" -> "JobsSwiftBaseDefines";
  "JobsSwiftAppTools" -> "JobsSwiftBaseTools";
  "JobsSwiftAppTools" -> "JobsSwiftBlock";
  "JobsSwiftAppTools" -> "JobsSwiftDSL";
  "JobsSwiftAppTools" -> "JobsSwiftTools";
  "JobsSwiftAppTools" -> "JobsTextTools";
  "JobsSwiftBaseDefines" -> "JobsSwiftBlock";
  "JobsSwiftBaseDefines" -> "JobsTextTools";
  "JobsSwiftBaseTools" -> "JobsByUIKit";
  "JobsSwiftBaseTools" -> "JobsSwiftBaseDefines";
  "JobsSwiftBaseTools" -> "JobsSwiftBlock";
  "JobsSwiftBaseTools" -> "JobsSwiftDSL";
  "JobsSwiftCalendar" -> "JobsSwiftBaseDefines";
  "JobsSwiftCalendar" -> "JobsSwiftDSL";
  "JobsSwiftComment" -> "JobsByUIKit";
  "JobsSwiftComment" -> "JobsSwiftBaseDefines";
  "JobsSwiftComment" -> "JobsSwiftDSL";
  "JobsSwiftCountryCodeCtrl" -> "JobsByUIKit";
  "JobsSwiftCountryCodeCtrl" -> "JobsSwiftBaseDefines";
  "JobsSwiftCountryCodeCtrl" -> "JobsSwiftDSL";
  "JobsSwiftCountryCodeCtrl" -> "Jobsl10n";
  "JobsSwiftDSL" -> "JobsSwiftBaseDefines";
  "JobsSwiftDSL" -> "JobsSwiftBlock";
  "JobsSwiftDSL" -> "JobsTextTools";
  "JobsSwiftDebugTools" -> "JobsByUIKit";
  "JobsSwiftDebugTools" -> "JobsSwiftBaseDefines";
  "JobsSwiftDebugTools" -> "JobsToast";
  "JobsSwiftExcel" -> "JobsByUIKit";
  "JobsSwiftExcel" -> "JobsSwiftBaseDefines";
  "JobsSwiftExcel" -> "JobsSwiftDSL";
  "JobsSwiftExcel" -> "JobsSwiftUILabelScrolling";
  "JobsSwiftFoundation" -> "JobsByUIKit";
  "JobsSwiftFoundation" -> "JobsSwiftDSL";
  "JobsSwiftGraphicCaptcha" -> "JobsSwiftBaseDefines";
  "JobsSwiftGraphicCaptcha" -> "JobsSwiftDSL";
  "JobsSwiftLinkageMenuView" -> "JobsSwiftBaseDefines";
  "JobsSwiftLinkageMenuView" -> "JobsSwiftDSL";
  "JobsSwiftMarkdown" -> "JobsSwiftBaseDefines";
  "JobsSwiftMarkdown" -> "JobsSwiftDSL";
  "JobsSwiftMetalKit" -> "JobsSwiftDSL";
  "JobsSwiftNumberStepper" -> "JobsByUIKit";
  "JobsSwiftNumberStepper" -> "JobsSwiftBaseDefines";
  "JobsSwiftNumberStepper" -> "JobsSwiftDSL";
  "JobsSwiftOpen" -> "JobsByUIKit";
  "JobsSwiftOpen" -> "JobsInheritance";
  "JobsSwiftRefresher" -> "JobsByUIKit";
  "JobsSwiftRefresher" -> "JobsFuseAnimation";
  "JobsSwiftRefresher" -> "JobsSwiftBaseDefines";
  "JobsSwiftRefresher" -> "JobsSwiftBlock";
  "JobsSwiftRefresher" -> "JobsSwiftDSL";
  "JobsSwiftSearcher" -> "JobsByUIKit";
  "JobsSwiftSearcher" -> "JobsSwiftBaseDefines";
  "JobsSwiftSearcher" -> "JobsSwiftDSL";
  "JobsSwiftSearcher" -> "Jobsl10n";
  "JobsSwiftSplash" -> "JobsByUIKit";
  "JobsSwiftSplash" -> "JobsCountdownButton";
  "JobsSwiftSplash" -> "JobsInheritance";
  "JobsSwiftSplash" -> "JobsSwiftBaseDefines";
  "JobsSwiftSplash" -> "JobsSwiftDSL";
  "JobsSwiftSplash" -> "JobsSwiftOpen";
  "JobsSwiftStandardLibrary" -> "JobsSwiftBaseDefines";
  "JobsSwiftTaskCenter" -> "JobsSwiftTimer";
  "JobsSwiftTimerMgr" -> "JobsSwiftTimer";
  "JobsSwiftTools" -> "Flutter";
  "JobsSwiftTools" -> "FlutterPluginRegistrant";
  "JobsSwiftTools" -> "JobsByPhotosUI";
  "JobsSwiftTools" -> "JobsByUIKit";
  "JobsSwiftTools" -> "JobsSwiftBaseDefines";
  "JobsSwiftTools" -> "JobsSwiftBlock";
  "JobsSwiftTools" -> "JobsSwiftDSL";
  "JobsSwiftTools" -> "JobsToast";
  "JobsSwiftUILabelScrolling" -> "JobsSwiftDSL";
  "JobsSwiftUILabelScrolling" -> "JobsSwiftTimer";
  "JobsSwiftWorker" -> "JobsByUIKit";
  "JobsSwiftWorker" -> "JobsSwiftBaseDefines";
  "JobsSwiftWorker" -> "JobsSwiftRefresher";
  "JobsSwiftWorker" -> "JobsSwiftTaskCenter";
  "JobsSwiftWorker" -> "JobsSwiftTimer";
  "JobsSwiftWorker" -> "Jobsl10n";
  "JobsToast" -> "JobsByUIKit";
  "JobsToast" -> "JobsSwiftBaseDefines";
  "JobsToast" -> "JobsSwiftBlock";
  "JobsToast" -> "JobsSwiftDSL";
  "JobsViewPush" -> "JobsSwiftBaseDefines";
  "JobsViewPush" -> "JobsSwiftDSL";
  "JobsWalletCard" -> "JobsByUIKit";
  "JobsWalletCard" -> "JobsSwiftBaseDefines";
  "JobsWalletCard" -> "JobsSwiftDSL";
  "TextureSwiftSupport" -> "Texture";
}
